from collections import defaultdict

alphabet = [
    '\x00', '৩', '১', '৪', '৮', '৯', '৭', '০', '৬', '৫', '২', '(', ',', '-', '।', ')',
    'ি', 'ৃ', 'া', 'ূ', 'ো', 'ু', 'ী', 'ে', 'ৌ', 'অ', 'ঔ', 'ঊ', 'ও', 'আ', 'ঈ', 'ঋ',
    'ঐ', 'ই', 'এ', 'উ', 'স', 'ম', 'ন', 'প', 'য', 'ণ', 'গ', 'ঘ', 'দ', 'খ', 'ক', 'ব',
    'ত', 'র', 'ল', 'ট', 'থ', 'ফ', 'ধ', 'ছ', 'হ', 'ষ', 'চ', 'শ', 'য়', 'জ', 'জ্ঞ', 'র্ধ',
    'র্ম', 'ল্প', 'ত্র', 'র্ত', 'র্গ', 'র্ট', 'প্ত', 'প্স', 'ন্দ', 'র্য', 'শ্চ', 'ক্র', 'স্থ', 'ম্প', 'ধ্য', 'শ্ব',
    'ন্য', 'দ্য', 'র্ব', 'স্ত', 'ঙ্গ', 'ত্য', 'প্র', 'ক্ষ', 'চ্চ', 'ন্ত', 'ব্দ', 'ষ্ট', 'শ্র', 'র্ষ', 'র্ক', 'স্ট',
    'গ্র', 'ত্ব', 'ং', '্'
]

alphabet_ord = [i for i in range(len(alphabet))]
# bangla [0, 1, 2, 3] english [0, 32, 33, 34]

alpha_to_num = defaultdict(int, list(map(reversed, enumerate(alphabet))))
# bangla {'\x00': 0, '৩': 1, '১': 2, '৪': 3} english {'\x00': 0, ' ': 1, '!': 2, '"': 3}

num_to_alpha = dict(enumerate(alphabet_ord))
# bangla {0: 0, 1: 1, 2: 2, 3: 3} english {0: 0, 1: 32, 2: 33, 3: 34}